flatiron_project5_backend/app/controllers/games_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "games" ("score", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["score", 6], ["user_id", 2], ["created_at", "2021-06-03 19:03:01.359288"], ["updated_at", "2021-06-03 19:03:01.359288"]]
---
  def create
    user = User.find_by(id: params[:userId])
    game = Game.create(score: params[:score], user: user)

SELECT "games".* FROM "games" ORDER BY "games"."score" DESC, "games"."created_at" DESC LIMIT ?  [["LIMIT", 20]]
---
  def high_scores
    games = Game.order(score: :desc, created_at: :desc).limit(20)