flatiron_project5_backend/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "abc@users.com"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(email: user_login_params[:email])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    logout_id = params[:id]
    user = User.find_by(id: logout_id)