flatiron_project5_backend/app/controllers/users_controller.rb

  def create
    if(params[:user][:email].match(/.+@.+\..+/))
      user = User.create(user_params)
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)